# 学生开题报告模版

注释：此模版作为学生的开题报告惨哦, 点击查看文档的[Markdown原始格式](https://code.csdn.net/CSDN_Code/CODE_Support/blob/master/oscamp_template_student_proposal.md)

## 自我推荐 
----

我是XXX学校大三的一名学生，虽不是计算机专业，但一直热爱编程，大学三年不玩游戏、不把妹子，一心苦苦只为做码农。对这个项目很感兴趣，这几天我已经阅读了这个项目的源代码，已经根据需求制定除了相应解决方案，非常渴望能够参与这个项目，为开源做出贡献！

## 解决方案 
----

第一，为了支持Fork的功能，首先需要对数据结构调整

1. 数据结构需要存储一个Fork Tree， 在数据库中应该体现Fork的链表结构
2. Fork项目的命名需要跟原来的项目一致，如果本地有重名需要自动加数字后缀
3. Fork时对代码仓库的操作，需要clone一份到新的用户下

功能实现方法：

1. Fork时创建数据结构，克隆项目仓库 ：增加新的Fork Controller实现
2. 展示根据数据结构实现Fork tree的展示和Fork的数量 ： 修改现有的 Project Show 的 Action 和 View
2. 删除时需要变化数据库中的链表，不允许删除父节点 ：修改相应的 Project Delete 的 Action 和 View

第二，为了支持Pull Request的共鞥， 需要做以下工作...

## 实施计划
----

- 当前～7月10日：搭建开发环境，熟悉项目现有代码， 跟导师做详细沟通
- 7月11日 ～ 7月21日：完成基础 “Fork” 功能开发
- 7月22日 ～ 7月25日：完善“Fork”的功能， 并增加相应单元测试
- 7月26日 ～ 7月31日：“Fork”功能测试、bug修复
- 8月1日 ～ 8月3日：撰写中期报告
- 8月4日 ～ 8月8日：配合中期检查，准备下一个月工作
- 8月9日 ～ 8月22日："Pull Request" 发出功能、对比功能、评论功能的开发
- 8月22日 ～ 8月29日："Pull Request" 列表、通知、自动合并功能的开发
- 8月30日 ～ 9月3日： 整体测试，修改bug
- 9月4日 ～ 9月7日：撰写结题报告

## 个人资料
----

**每周工作时间**

约40小时

**项目经验**

- 学校图书馆图书管理项目开发 


**技能**

- 熟练掌握 C, C++, Java 语言
- 熟悉Web开发，熟悉 html, css, js  
- 对算法研究颇有心得

**个人荣誉**

- 2013年计算机编程大赛全国二等奖
- 2013年校级优秀学生

**参与过开源的项目**

- <https://github.com/gitlabhq/gitlabhq> ，作为贡献者提交被采纳， 我的ID为xxxxxx
- <https://github.com/gitlabhq/gitlabhq> ，作为贡献者提交被采纳， 我的ID为xxxxxx

**参加过的开源活动**

- 作为志愿者参见 GNOME.Asia 2014年峰会